RT-Thread/rt-thread/bsp/stm32/libraries/STM32G4xx_HAL/STM32G4xx_HAL_Driver/Inc/stm32g4xx_hal_tim.h
#define IS_TIM_OC_MODE(__MODE__)  (((__MODE__) == TIM_OCMODE_TIMING)             || \
                                   ((__MODE__) == TIM_OCMODE_ACTIVE)             || \
                                   ((__MODE__) == TIM_OCMODE_INACTIVE)           || \
                                   ((__MODE__) == TIM_OCMODE_TOGGLE)             || \
                                   ((__MODE__) == TIM_OCMODE_FORCED_ACTIVE)      || \
                                   ((__MODE__) == TIM_OCMODE_FORCED_INACTIVE)    || \
                                   ((__MODE__) == TIM_OCMODE_RETRIGERRABLE_OPM1) || \
                                   ((__MODE__) == TIM_OCMODE_RETRIGERRABLE_OPM2) || \
                                   ((__MODE__) == TIM_OCMODE_DIRECTION_OUTPUT)   || \
                                   ((__MODE__) == TIM_OCMODE_PULSE_ON_COMPARE))

#if defined (TIM5) && defined(TIM20)
#define IS_TIM_TRIGGER_SELECTION(__SELECTION__) (((__SELECTION__) == TIM_TS_ITR0)     || \
                                                 ((__SELECTION__) == TIM_TS_ITR1)     || \
                                                 ((__SELECTION__) == TIM_TS_ITR2)     || \
                                                 ((__SELECTION__) == TIM_TS_ITR3)     || \
                                                 ((__SELECTION__) == TIM_TS_TI1F_ED)  || \
                                                 ((__SELECTION__) == TIM_TS_TI1FP1)   || \
                                                 ((__SELECTION__) == TIM_TS_TI2FP2)   || \
                                                 ((__SELECTION__) == TIM_TS_ITR4)     || \
                                                 ((__SELECTION__) == TIM_TS_ITR5)     || \
                                                 ((__SELECTION__) == TIM_TS_ITR6)     || \
                                                 ((__SELECTION__) == TIM_TS_ITR7)     || \
                                                 ((__SELECTION__) == TIM_TS_ITR8)     || \
                                                 ((__SELECTION__) == TIM_TS_ITR9)     || \
                                                 ((__SELECTION__) == TIM_TS_ITR10)    || \
                                                 ((__SELECTION__) == TIM_TS_ITR11)    || \
                                                 ((__SELECTION__) == TIM_TS_ETRF))

#define IS_TIM_INTERNAL_TRIGGEREVENT_SELECTION(__SELECTION__) (((__SELECTION__) == TIM_TS_ITR0) || \
                                                               ((__SELECTION__) == TIM_TS_ITR1) || \
                                                               ((__SELECTION__) == TIM_TS_ITR2) || \
                                                               ((__SELECTION__) == TIM_TS_ITR3) || \
                                                               ((__SELECTION__) == TIM_TS_ITR4) || \
                                                               ((__SELECTION__) == TIM_TS_ITR5) || \
                                                               ((__SELECTION__) == TIM_TS_ITR6) || \
                                                               ((__SELECTION__) == TIM_TS_ITR7) || \
                                                               ((__SELECTION__) == TIM_TS_ITR8) || \
                                                               ((__SELECTION__) == TIM_TS_ITR9) || \
                                                               ((__SELECTION__) == TIM_TS_ITR10)|| \
                                                               ((__SELECTION__) == TIM_TS_ITR11)|| \
                                                               ((__SELECTION__) == TIM_TS_NONE))
#elif defined (TIM5)
#define IS_TIM_TRIGGER_SELECTION(__SELECTION__) (((__SELECTION__) == TIM_TS_ITR0)     || \
                                                 ((__SELECTION__) == TIM_TS_ITR1)     || \
                                                 ((__SELECTION__) == TIM_TS_ITR2)     || \
                                                 ((__SELECTION__) == TIM_TS_ITR3)     || \
                                                 ((__SELECTION__) == TIM_TS_TI1F_ED)  || \
                                                 ((__SELECTION__) == TIM_TS_TI1FP1)   || \
                                                 ((__SELECTION__) == TIM_TS_TI2FP2)   || \
                                                 ((__SELECTION__) == TIM_TS_ITR4)     || \
                                                 ((__SELECTION__) == TIM_TS_ITR5)     || \
                                                 ((__SELECTION__) == TIM_TS_ITR6)     || \
                                                 ((__SELECTION__) == TIM_TS_ITR7)     || \
                                                 ((__SELECTION__) == TIM_TS_ITR8)     || \
                                                 ((__SELECTION__) == TIM_TS_ITR10)    || \
                                                 ((__SELECTION__) == TIM_TS_ITR11)    || \
                                                 ((__SELECTION__) == TIM_TS_ETRF))

#define IS_TIM_INTERNAL_TRIGGEREVENT_SELECTION(__SELECTION__) (((__SELECTION__) == TIM_TS_ITR0) || \
                                                               ((__SELECTION__) == TIM_TS_ITR1) || \
                                                               ((__SELECTION__) == TIM_TS_ITR2) || \
                                                               ((__SELECTION__) == TIM_TS_ITR3) || \
                                                               ((__SELECTION__) == TIM_TS_ITR4) || \
                                                               ((__SELECTION__) == TIM_TS_ITR5) || \
                                                               ((__SELECTION__) == TIM_TS_ITR6) || \
                                                               ((__SELECTION__) == TIM_TS_ITR7) || \
                                                               ((__SELECTION__) == TIM_TS_ITR8) || \
                                                               ((__SELECTION__) == TIM_TS_ITR10)|| \
                                                               ((__SELECTION__) == TIM_TS_ITR11)|| \
                                                               ((__SELECTION__) == TIM_TS_NONE))
#else
#define IS_TIM_TRIGGER_SELECTION(__SELECTION__) (((__SELECTION__) == TIM_TS_ITR0)    || \
                                                 ((__SELECTION__) == TIM_TS_ITR1)    || \
                                                 ((__SELECTION__) == TIM_TS_ITR2)    || \
                                                 ((__SELECTION__) == TIM_TS_ITR3)    || \
                                                 ((__SELECTION__) == TIM_TS_TI1F_ED) || \
                                                 ((__SELECTION__) == TIM_TS_TI1FP1)  || \
                                                 ((__SELECTION__) == TIM_TS_TI2FP2)  || \
                                                 ((__SELECTION__) == TIM_TS_ITR5)    || \
                                                 ((__SELECTION__) == TIM_TS_ITR6)    || \
                                                 ((__SELECTION__) == TIM_TS_ITR7)    || \
                                                 ((__SELECTION__) == TIM_TS_ITR8)    || \
                                                 ((__SELECTION__) == TIM_TS_ITR10)   || \
                                                 ((__SELECTION__) == TIM_TS_ITR11)   || \
                                                 ((__SELECTION__) == TIM_TS_ETRF))

#define IS_TIM_INTERNAL_TRIGGEREVENT_SELECTION(__SELECTION__) (((__SELECTION__) == TIM_TS_ITR0) || \
                                                               ((__SELECTION__) == TIM_TS_ITR1) || \
                                                               ((__SELECTION__) == TIM_TS_ITR2) || \
                                                               ((__SELECTION__) == TIM_TS_ITR3) || \
                                                               ((__SELECTION__) == TIM_TS_ITR5) || \
                                                               ((__SELECTION__) == TIM_TS_ITR6) || \
                                                               ((__SELECTION__) == TIM_TS_ITR7) || \
                                                               ((__SELECTION__) == TIM_TS_ITR8) || \
                                                               ((__SELECTION__) == TIM_TS_ITR10)|| \
                                                               ((__SELECTION__) == TIM_TS_ITR11)|| \
                                                               ((__SELECTION__) == TIM_TS_NONE))
#endif /* TIM5 && TIM20 */

#define IS_TIM_TRIGGERPOLARITY(__POLARITY__)   (((__POLARITY__) == TIM_TRIGGERPOLARITY_INVERTED   ) || \
                                                ((__POLARITY__) == TIM_TRIGGERPOLARITY_NONINVERTED) || \
                                                ((__POLARITY__) == TIM_TRIGGERPOLARITY_RISING     ) || \
                                                ((__POLARITY__) == TIM_TRIGGERPOLARITY_FALLING    ) || \
                                                ((__POLARITY__) == TIM_TRIGGERPOLARITY_BOTHEDGE   ))

#define IS_TIM_TRIGGERPRESCALER(__PRESCALER__) (((__PRESCALER__) == TIM_TRIGGERPRESCALER_DIV1) || \
                                                ((__PRESCALER__) == TIM_TRIGGERPRESCALER_DIV2) || \
                                                ((__PRESCALER__) == TIM_TRIGGERPRESCALER_DIV4) || \
                                                ((__PRESCALER__) == TIM_TRIGGERPRESCALER_DIV8))

